package kr.ac.kopo.day09.Homework;

public class Homework01 {

	public static void main(String[] args) {
		// 1. 컴퓨터가 생각하고 있는 1 ~ 100사이의 정수를 맞추는 프로그램을 작성하시오
		/*
		 * 1 ~100 : 50
		 * 50보다 큰수입니다.
		 * 
		 * 기최는 총 5번 남았습니다.
		 * 
		 * 51-100: 70
		 * 70보다 작은 수입니다.
		 * 
		 * 51-69:77
		 * 51-69 : 63
		 * 63보다 작은수입니다.
		 * 기회는 총 3번 남았습니다.
		 * 
		 * 51-62 : 55
		 * 55보다 큰 수입니다.
		 * 기회는 총 2번남았습니다.
		 * 
		 * 56-62:59
		 * 59보다 큰수입니다.
		 * 기회는 총 1번 남았습니다.
		 * 
		 * 60-61:60
		 *  옵션 ) 기회는 총 0번 남았습니다. 라고 써도 됨..
		 * 아쉽습니다. 기회를 소진하셨습니다.
		 * 정답은 [61]입니다.
		 * 
		 * ----만약
		 * 60 -61 : 61
		 * 축하합니다. 정답입니다.
		 */
	}

}
